# Label Utils Get Label For(gb XMLBuilding Type, Document) Method

Source: https://www.revitapidocs.com/2026/3e86f8bf-b9b6-5383-3f65-0a9c9a5acf61.htm

---

| Label Utils Get Label For(gb XMLBuilding Type, Document) Method |
| --- |

Gets the user\-visible name for a gbXMLBuildingType.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static string GetLabelFor(
	gbXMLBuildingType buildingType,
	Document document
)
```

```
Public Shared Function GetLabelFor (
	buildingType As gbXMLBuildingType,
	document As Document
) As String
```

```
public:
static String^ GetLabelFor(
	gbXMLBuildingType buildingType,
	Document^ document
)
```

```
static member GetLabelFor :
        buildingType : gbXMLBuildingType *
        document : Document -> string
```

#### Parameters

buildingType gbXMLBuildingType
:   The gbXMLBuildingType to get the user\-visible name.

document Document
:   The document from which to get the gbXMLBuildingType.

#### Return Value

String
Returns the user\-visible name for a buildingType in gbXML. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The input gXMLBuildingType is not available in the document. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Remarks The name is obtained in the current Revit language. See Also

#### Reference

LabelUtils Class GetLabelFor Overload Autodesk.Revit.DB Namespace